export/issues/8.tex
% Created 2024-07-06 Sat 17:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: Issue 8}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: Issue 8},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Issue 8 (Interaction with FORMAT)}
\label{sec:org0662517}
\emph{by |3b|}
\subsection{Description}
\label{sec:org603741c}
It is not clear how \emph{local nicknames} should affect the tilde slash \texttt{\textbackslash{}\textasciitilde{}//}
directive of \texttt{format}.
\subsection{Notes}
\label{sec:org134f5f7}
\begin{itemize}
\item If \texttt{\textbackslash{}\textasciitilde{}//} directive wasn't affected by \emph{local nicknames}, it would mean that
using [long and not-so-easy-to-use] package names is necessary.

\item It would be counterintuitive if the function used by the \texttt{\textbackslash{}\textasciitilde{}//} directive could
change based on the \emph{current package} at \textbf{execution time} (that is, if the
symbol lookup was affected by \emph{local nicknames} of the \emph{current package}).

This could also break existing code if a \emph{local nickname} in the \emph{current
package} shadows the name of a package containing a function used in a format
control string in the called function. The only way to prevent this issue would
be to rebind the \texttt{*package*} variable around any call to \texttt{format} where the
\texttt{\textbackslash{}\textasciitilde{}//} directive is used.

\item Finally, if the call to \texttt{format} is not compiled, it would be hard to impossible
to find the function using \emph{local nicknames} of the package that was the
\emph{current package} at \textbf{compile time}.
\end{itemize}
\subsection{Examples}
\label{sec:orgf7afc50}
\begin{verbatim}
(defpackage #:foo-a (:use) (:export #:ff))
(defpackage #:foo-b (:use) (:export #:ff))

(defun foo-a:ff (stream &rest args)
  (declare (ignore args))
  (format stream "FOO-A:FF"))

(defun foo-b:ff (stream &rest args)
  (declare (ignore args))
  (format stream "FOO-B:FF"))

(defpackage #:bar-a
  (:use #:cl)
  (:local-nicknames (#:nick #:foo-a)))

(defpackage #:bar-b
  (:use #:cl)
  (:local-nicknames (#:nick #:foo-b)))

(in-package #:bar-a)

(defun test ()
  (format t "Called ~/nick:ff/ & " nil)
  (let ((*package* (find-package (quote #:bar-a))))  ; or #.*package*
    (format t "~/nick:ff/~%" nil)))

(test)
; => "Called FOO-A:FF & FOO-A:FF"  (sbcl, ccl, ecl, acl, abcl, clasp)
; lispworks errors (NICK package not found)
(let ((*package* (find-package (quote #:bar-b))))
  (test))
; => "Called FOO-A:FF & FOO-A:FF"  (sbcl, clasp)
; => "Called FOO-B:FF & FOO-A:FF"  (ccl, ecl, acl, abcl)
; lispworks errors (NICK package not found)
\end{verbatim}
\subsection{Proposal NOT-AFFECTED-BY-LOCAL-NICKNAMES}
\label{sec:orgbfe6e5d}
The tilde slash \texttt{\textbackslash{}\textasciitilde{}//} directive of \texttt{format} must \textbf{not} use \emph{local nicknames} of
any package when looking up the specified symbol.
\subsubsection{Rationale}
\label{sec:org24f46e2}
When the package prefix is not specified, the specified symbol is not looked up
in the \emph{current package}, but instead in the \texttt{\#:CL-USER} package. That suggests
that the tilde slash \texttt{\textbackslash{}\textasciitilde{}//} directive should not depend on the value of
\texttt{*package*} at any time.

Note that specifying it to use \emph{local nicknames} of the \texttt{\#:CL-USER} package would
risk breaking the existing code, since it is allowed to add local nicknames to
the \texttt{\#:CL-USER} package.
\subsection{Links}
\label{sec:orgc0eb55a}
See \href{https://www.lispworks.com/documentation/HyperSpec/Body/22\_ced.htm}{CLHS 22.3.5.4 Tilde Slash: Call Function}.
\end{document}